#### [데이터 필터링]
- 원하는 데이터를 추출하기 위해 사용하는 방법
- 원하는 데이터를 걸러냄
- 다양한 조건검사 진행=> 비교 검사: ==, !=, >, >=, <, <=

(1) 모듈 로딩<hr>

In [1]:
import pandas as pd
import numpy as np

(2) 데이터 준비<hr>

In [2]:
file = "../DATA/employees.csv"

(3) 파일 저장<hr>

In [4]:
empDF = pd.read_csv(file)

(4) 데이터 확인(생략)<hr>

(5) 데이터 다루기.<hr>

In [5]:
'Happy' == "Happy", "Happy" != "happy"

(True, True)

- employees 데이터에서 이름이 Maria인 데이터만 추출하기

In [25]:
print( empDF.columns, empDF.index, sep = '\n\n')

Index(['First Name', 'Gender', 'Start Date', 'Salary', 'Mgmt', 'Team'], dtype='object')

RangeIndex(start=0, stop=1001, step=1)

In [26]:
(empDF['First Name'] == 'Maria').sum() #boolean 데이터로 이루어진 시리즈, True = 1, False = 0으로 계

6

- bool 값으로 구성된 데이터 = "Boolean indexing"(불린 인덱싱)

In [27]:
mariaMask=(empDF['First Name'] == 'Maria')
type(mariaMask)

pandas.core.series.Series

In [28]:
empDF[mariaMask]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
198      Maria  Female   12/27/90   36067.0   True       Product
815      Maria     NaN    1/18/86  106562.0  False            HR
844      Maria     NaN    6/19/85  148857.0  False         Legal
936      Maria  Female    3/14/03   96250.0  False  Business Dev
984      Maria  Female   10/15/11   43455.0  False   Engineering

- employees 데이터에서 연봉이 50000 이상인 데이터의 이름 항목을 추출하시오.

In [29]:
salary5man = (empDF['Salary']>=100000)
salary5man

0       False
1       False
2        True
3        True
4        True
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Salary, Length: 1001, dtype: bool

In [30]:
empDF[salary5man]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
3        Jerry     NaN     3/4/05  138705.0   True       Finance
4        Larry    Male    1/24/98  101004.0   True            IT
5       Dennis    Male    4/18/87  115163.0  False         Legal
9      Frances  Female     8/8/02  139852.0   True  Business Dev
..         ...     ...        ...       ...    ...           ...
990      Robin  Female    7/24/87  100765.0   True            IT
991       Rose  Female    8/25/02  134505.0   True     Marketing
992    Anthony    Male   10/16/11  112769.0   True       Finance
995      Henry     NaN   11/23/14  132483.0  False  Distribution
999     Albert    Male    5/15/12  129949.0   True         Sales

[409 rows x 6 columns]

- employees 데이터에서 성별이 남자이고 연봉이 100000 이상인 데이터 추출하기

- 여러 개의 조건이 True여야만 하는 조건 = and(&).

In [42]:
mask = (empDF['Gender'] == 'Male') & (empDF['Salary'] >= 100000)
empDF[mask]

    First Name Gender Start Date    Salary   Mgmt         Team
4        Larry   Male    1/24/98  101004.0   True           IT
5       Dennis   Male    4/18/87  115163.0  False        Legal
12     Brandon   Male    12/1/80  112807.0   True           HR
13        Gary   Male    1/27/08  109831.0  False        Sales
17       Shawn   Male    12/7/86  111737.0  False      Product
..         ...    ...        ...       ...    ...          ...
979     Ernest   Male    7/20/13  142935.0   True      Product
981      James   Male    1/15/93  148985.0  False        Legal
983       John   Male   12/23/82  146907.0  False  Engineering
992    Anthony   Male   10/16/11  112769.0   True      Finance
999     Albert   Male    5/15/12  129949.0   True        Sales

[176 rows x 6 columns]

- 여러개의 조건 중 한개 이상이 True면 True가 되는 조건: OR
    - 문법: 조건1|조건2|조건3|...조건n|
    - 연산자: |;파이프
    - 결과 : True/False

- employees 데이터에서 입사일이 1993년 1월 1일 이전이거나 Mgmt이 없는 사람 데이터 추출하기

In [44]:
mask2 = (empDF['Start Date'] <'1/1/1993') | (empDF['Mgmt'] == False)
empDF[mask2]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
5       Dennis    Male    4/18/87  115163.0  False         Legal
13        Gary    Male    1/27/08  109831.0  False         Sales
15     Lillian  Female     6/5/16   59414.0  False       Product
16      Jeremy    Male    9/21/10   90370.0  False            HR
..         ...     ...        ...       ...    ...           ...
989     Justin     NaN    2/10/91   38344.0  False         Legal
995      Henry     NaN   11/23/14  132483.0  False  Distribution
996    Phillip    Male    1/31/84   42392.0  False       Finance
997    Russell    Male    5/20/13   96914.0  False       Product
998      Larry    Male    4/20/13   60500.0  False  Business Dev

[466 rows x 6 columns]

In [51]:
empDF['Start Date']=pd.to_datetime(empDF['Start Date'])
empDF['Start Date']

0      1993-08-06
1      1996-03-31
2             NaT
3      2005-03-04
4      1998-01-24
          ...
996    1984-01-31
997    2013-05-20
998    2013-04-20
999    2012-05-15
1000          NaT
Name: Start Date, Length: 1001, dtype: datetime64[ns]

In [53]:
(empDF['Team']=='Sales')|(empDF['Team']=='Legal')|(empDF['Team'] == 'Marketing')

0        True
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Team, Length: 1001, dtype: bool

In [56]:
empDF ["Team"].isin(['Sales', 'Legal', 'Marketing'])

0        True
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Team, Length: 1001, dtype: bool

- 구간 지정 검사 불린 메서드: DF.between(low,high)

In [57]:
(empDF['Salary']>=80000)&(empDF['Salary']<90000)

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [58]:
empDF['Salary'].between(80000,90000)

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [59]:
empDF['First Name'].str.upper() #지시자

0       DOUGLAS
1        THOMAS
2         MARIA
3         JERRY
4         LARRY
         ...
996     PHILLIP
997     RUSSELL
998       LARRY
999      ALBERT
1000        NaN
Name: First Name, Length: 1001, dtype: object

In [ ]:
empDF ['First Name'].str.replace()